app/controllers/invoices_controller.rb

  def index
    @invoices = Invoice.all
---
SELECT "invoices".* FROM "invoices"

  def show
    @invoice = Invoice.find(params[:id])
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @invoice = Invoice.new(invoice_params)

    @invoice.assign_attributes(user: User.find_by_name(invoice_params[:user_id]))

    respond_to do |format|
      if @invoice.save
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "432643263426"]]
INSERT INTO "invoices" ("product", "amount", "card_type", "card_last4", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["product", "Swords"], ["amount", 500.99], ["card_type", "Visa"], ["card_last4", 4444], ["user_id", 0], ["created_at", "2017-05-31 23:04:38.750265"], ["updated_at", "2017-05-31 23:04:38.750265"]]

  def update
    respond_to do |format|
      if @invoice.update(invoice_params)
---
UPDATE "invoices" SET "signature" = $1, "updated_at" = $2 WHERE "invoices"."id" = $3  [["signature", "<24143 bytes of binary data>"], ["updated_at", "2017-06-02 00:02:02.379447"], ["id", 53]]

    def set_invoice
      @invoice = Invoice.find(params[:id])
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 53]]